{
  "ModuleNotFoundError: No module named 'moviepy.editor'": "MoviePy v2.x removed the 'moviepy.editor' subpackage. Fix: change ALL imports from 'from moviepy.editor import X' to 'from moviepy import X'. Applies to VideoFileClip, AudioFileClip, CompositeVideoClip, TextClip, ColorClip, concatenate_videoclips, CompositeAudioClip. Check both top-level and inline imports throughout the codebase.",
  "ModuleNotFoundError: No module named 'audioop'": "Python 3.13+ removed the built-in 'audioop' module. The 'pydub' library depends on it. Fix: add 'audioop-lts' to requirements.txt. This provides a drop-in replacement backport.",
  "ModuleNotFoundError: No module named 'pyaudioop'": "Python 3.14 removed 'audioop'. The pydub fallback 'pyaudioop' doesn't exist on PyPI. Fix: pip install 'audioop-lts' instead.",
  "AttributeError: type object 'PrivacyStatusEnum' has no attribute 'PRIVATE'": "Enum was defined with lowercase member names (private, public, unlisted) but referenced with UPPERCASE. Fix: ensure all references match the enum definition exactly. Also check for duplicate/shadowing class definitions that override canonical module imports.",
  "AttributeError: 'NoneType' object has no attribute 'before_first_request'": "Flask removed @app.before_first_request in version 2.3+. Fix: remove the decorator and call the function directly during app initialization, e.g. at module level or inside the create_app() factory.",
  "KeyError: 'FLASK_SECRET_KEY'": "Flask config loads class attributes by their original name. Config.SECRET_KEY becomes app.config['SECRET_KEY'], NOT app.config['FLASK_SECRET_KEY']. Fix: use the attribute name as defined in the Config class.",
  "ImportError: cannot import name 'seconds_to_hms'": "Function was generated with a different name than what other modules import. This is a cross-file naming consistency bug. Fix: add an alias at the bottom of the source module (e.g., seconds_to_hms = format_seconds_to_hhmmss), or rename all references to match.",
  "GENERATION_RULE__NO_DUPLICATE_CLASS_DEFINITIONS": "IMPORTANT: When generating multi-file Python projects, NEVER include inline duplicate class/enum definitions at the top of service files (e.g. duplicating schemas or config in youtube_service.py). These shadow the canonical imports that appear later and cause version mismatches. Only use 'from module import ClassName'.",
  "GENERATION_RULE__CROSS_FILE_SYMBOL_CONSISTENCY": "When generating functions in one module and importing them in another, the import name MUST match the function definition exactly. Track all exported symbols using ProjectState and verify cross-file import consistency before finalizing code.",
  "GENERATION_RULE__CONFIG_ATTRIBUTE_NAMES": "When generating a Config class and code that reads from app.config[], the attribute names must match exactly. If Config defines ORIGINALS_DIR, code must use app.config['ORIGINALS_DIR'], not app.config['MEDIA_ORIGINALS_DIR']. Establish naming conventions up front and enforce them.",
  "GENERATION_RULE__PYTHON_314_STDLIB_REMOVALS": "Python 3.13+ removed these stdlib modules: audioop, cgi, cgitb, chunk, crypt, imghdr, mailcap, msilib, nis, nntplib, ossaudiodev, pipes, sndhdr, spwd, sunau, telnetlib, uu, xdrlib. When any dependency needs these (e.g., pydub needs audioop), add the corresponding '-lts' backport to requirements.txt.",
  "GENERATION_RULE__MOVIEPY_V2_IMPORTS": "MoviePy 2.x breaking change: 'moviepy.editor' no longer exists. All imports must use 'from moviepy import X' directly. Apply this to BOTH top-level imports AND any lazy/inline imports inside functions.",
  "GENERATION_RULE__FLASK_DEPRECATED_APIS": "Flask 2.3+ removed: @app.before_first_request. Flask 2.3+ deprecated: @app.before_request for setup tasks. Use direct function calls during app initialization instead of these decorators.",
  "GENERATION_RULE__ENUM_CASING_CONVENTION": "When defining Python enums with string values, ensure all references use the exact member name. If values are lowercase (private='private'), references must be EnumClass.private, NOT EnumClass.PRIVATE. Validate this across all files that import the enum.",
  "GENERATION_RULE__PYDANTIC_V2_MIGRATION": "Pydantic v2 breaking changes: 'from pydantic import validator' is REMOVED — use 'from pydantic import field_validator' with mode='before'/'after'. 'class Config:' inside models is REMOVED — use 'model_config = ConfigDict(...)'. 'BaseSettings' moved to 'pydantic-settings' package — add 'pydantic-settings' to requirements.txt and import from 'pydantic_settings'. '.dict()' is now '.model_dump()', '.json()' is now '.model_json_schema()'. Always check the pinned Pydantic version from pre-flight search.",
  "GENERATION_RULE__FASTAPI_PYDANTIC_PINNING": "FastAPI depends on Pydantic. When planning a FastAPI project, ALWAYS use the exact versions returned by the Pre-Flight Search agent for both 'fastapi' and 'pydantic'. Never guess versions. If pre-flight returns pydantic>=2.0, apply all Pydantic v2 patterns. Pin versions in requirements.txt as 'fastapi==X.Y.Z' and 'pydantic==X.Y.Z'.",
  "GENERATION_RULE__MOVIEPY_V2_API_RENAMES": "MoviePy 2.x renamed ALL setter/transform methods to immutable-style names. CRITICAL RENAMES: .subclip() -> .subclipped(), .set_position() -> .with_position(), .set_duration() -> .with_duration(), .set_audio() -> .with_audio(), .set_start() -> .with_start(), .set_end() -> .with_end(), .set_opacity() -> .with_opacity(), .set_fps() -> .with_fps(), .volumex() -> .with_volume_scaled(), .resize() -> .resized(), .crop() -> .cropped(), .rotate() -> .rotated(). TextClip constructor changed: first positional arg is now 'font' (file path to .ttf, NOT font name), 'text' is keyword-only. 'fontsize' param renamed to 'font_size'. Font must be a full path like 'C:/Windows/Fonts/arial.ttf', not just 'Arial'. Use .resized(new_size=(...)) not .resized(newsize=(...)).",
  "NameError: name 'fastapi' is not defined. Did you mean: 'FastAPI'?": "LLM repaired logic in app.py. Review the fix if error recurs.",
  "ImportError: cannot import name 'VideoFileClip' from 'moviepy' (C:\\Users\\thatg\\AppData\\Roaming\\Python\\Python314\\site-packages\\moviepy\\__init__.py)": "Ensure the imported symbol exists and is spelled correctly in the source module.",
  "ImportError: cannot import name 'Episode' from 'app.models.episode' (C:\\Users\\thatg\\Desktop\\Creator\\output\\GeneratedApp\\app\\models\\episode.py)": "Ensure the imported symbol exists and is spelled correctly in the source module.",
  "GENERATION_RULE__LOOP_SAFETY": "CRITICAL: All generated 'while' loops MUST include a 'time.sleep()' or 'await asyncio.sleep()' call to prevent infinite CPU-intensive hangs. Even 0.01s is acceptable. Apps surviving a smoke test timeout with ZERO output are flagged as HANGS.",
  "GENERATION_RULE__WINDOWS_PLATFORM_SAFETY": "The 'curses' module is NOT native to Windows. For CLI UI, favor 'rich', 'colorama', or 'windows-curses'. Recommending 'rich' for its superior cross-platform support and modern aesthetics.",
  "GENERATION_RULE__SILENT_HANG_FAILURE": "Generated programs that produce NO stdout/stderr for more than 15 seconds during verification are considered FAILED (Zombie Hang). Ensure loops contain logging or progress markers."
}